<div style="font-size:48px; line-height:1.2;">
    <center>
COMS W4111-002, Fall 21: <br>Take Home Midterm
</center>


<hr style="height:2px;">
<br>

# Overview

## Instructions

#### Due Date: Sunday, October 31, 2021 at 11:59pm  


You have one week to complete the take home portion of the midterm. All of the work must be your own, you may not work in groups or teams. You may use outside sources so long as you cite them and provide links. 

Points will be taken off for any answers that are extremely verbose. Try to stay between 2-3 sentences for definitions and 5 sentences for longer questions. 

You may post __privately__ on Ed or attend OH for clairification questions. TAs will not be providing hints.

## Environment Setup

- __Note:__ You will need to change the MySQL userID and password in some of the cells below to match your configuration.

In [3]:
%load_ext sql

In [9]:
%sql mysql+pymysql://admin:7Senses_kiki@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb

In [3]:
from sqlalchemy import create_engine

In [4]:
sql_engine = create_engine("mysql+pymysql://admin:7Senses_kiki@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com")

In [5]:
import pandas as pd

# Written Questions

## W1

Provide a short (two or three sentence) definition/description of the following terms. Provide an example from the Lahman's Baseball DB for each.

__Notes:__
- Lahman's Baseball DB uses auto-increment ID columns for primary keys. If ignoring the ID column makes answering the question easier, you can assume that the column and current primary keys are not defined.
- Some of these concepts do not have a single, precise, agreed definition. You may find slight differences in your research. Focus on the concept and grading will be flexible.
<br><br><br>

1. Super Key<br><br>
1. Candidate Key<br><br>
1. Primary Key<br><br>
5. Alternate Key<br><br>
6. Unique Key<br><br>
2. Natural Key<br><br>
2. Surrogate Key<br><br>
2. Substitute Key<br><br>
7. Foreign Key<br><br>
8. External Key

<u>Answer</u><br>
1. A super key is a set of attributes that uniquely identifies each tuple of a relation.<br>In the People table from Lahman's Baseball DB, the combination of 'playerID' and 'birthYear' is a super key.<br><br>
2. A candidate key is a minimal super key, which can uniquely identifies each tuple of a relation and has no redundant attributes.<br>In the People table from Lahman's Baseball DB, 'playerID' is a candidate key.<br><br>
3. A primary key is a candidate key that is chosen by the database designer as the principal means of identifying tuples within a relation.<br>In the People table from Lahman's Baseball DB, 'playerID' is a primary key.<br><br>
4. An alternate key is a candidate key which is not the primary key.<br>In the Batting table from Lahman's Baseball DB, the combination of 'playerID', 'yearID , and 'stint' is an alternate key.<br><br>
5. A unique key is a candidate key which is not the primary key, so it is the same as alternate key.<br>In the Batting table from Lahman's Baseball DB, the combination of 'playerID', 'yearID , and 'stint' is an alternate key.<br><br>
6. A natural key is a candidate key formed of attributes that exist and are used in the external world outside the database.<br>In the People table from Lahman's Baseball DB, 'playerID' is a natural key.<br><br>
7. A surrogate key is a system generated value with no business meaning that is used to uniquely identify each tuple of a relation.<br>In the Batting table from Lahman's Baseball DB, ignoring the 'ID' column as the primary key, 'ID' is a surrogate key.<br><br>
8. A substitute key is a single, small attribute that has at least some descriptive value.<br>In the People table from Lahman's Baseball DB, 'birthState' is a substitute key.<br><br>
9. A foreign key is a set of attributes that allow us to establish a referential link between the data in two tables.<br>In the Batting table from Lahman's Baseball DB, the 'playerID' is a foreign key which references the 'playerID' in the People table.<br><br>
10. An external key is an attribute that appears to be a surrogate or substitute key, but has been defined by someone else, usually a standards-setting organization or a government agency.<br>In the Batting table from Lahman's Baseball DB, ignoring the 'ID' column as the primary key, 'ID' is an external key.<br><br>
Reference: https://web.csulb.edu/colleges/coe/cecs/dbdesign/dbdesign.php?page=keys.php

# W2

- Define the concept of _immutable_ column and key.


- Why do some sources recommend that a primary key should be immutable?


- How would to implement immutability for a primary key in a table?

<u>Answer</u>

1. Immutable columns and keys are columns and keys whose values should not be changed during the course of normal operations of the database. The values may only be set through construction.<br><br>
2. Since a primary key should be expected to be found in many places/duplicated (as foreign keys), if the primary key changes, all of the "child" tables have to change too, which is a very expensive process.<br><br>
3. Don't grant the update privilege for the primary key to any user and set a trigger to raise an error when updating the primary key.<br><br>

# W3

_Views_ are a powerful concept in relational database management systems. List and briefly explain 3 benefits of/reasons for creating a view.

<u>Answer</u>

1. Security. Each user can be given permission to access the database only through a small set of views that contain the specific data the user is authorized to see, thus restricting the user's access to stored data.<br><br>
2. Query Simplicity. A view can draw data from several different tables and present it as a single table, turning multi-table queries into single-table queries against the view.<br><br>
3. Structural Simplicity. Views can give a user a "personalized" view of the database structure, presenting the database as a set of virtual tables that make sense for that user.<br><br>
Reference: https://www.c-sharpcorner.com/blogs/advantages-and-disadvantages-of-views-in-sql-server1

# W4

Briefly explain the concepts of _procedural_ language and _declarative_ language. SQL is a declarative language. What are some advantages of a declarative language over a procedural language?

<u>Answer</u>

Procedural language outlines a specific set of steps that must be taken in order to arrive at the desired outcome, which requires the user to specify what data are needed and how to get those data. Declarative language tells the program what needs to be done and allows the program to figure out the necessary steps, which only requires the user to specify what data are needed.<br><br>
Declarative language is usually easier to learn and use than Procedural language. Also, Declaritive language helps to create a more flexible program that can be used in different contexts. As long as the final outcome is clearly specified, the steps to get there will be automatically generated. By operating at a higher level of abstract thinking, there is plenty of room for optimization. In addition, Declarative language tends to use short and efficient code for faster and more convenient programming.

# W5

The following diagram is a simple representation of the architecture of a Jupyter notebook using MySQL. Is this a two-tier architecture or a three-tier architecture? Explain your answer briefly.

<img src="./jupyter-architecture.png">

<u>Answer</u>

This is a three-tier architecture. The user and the communication with the browser is the presentation tier, whose purpose is to display information to and collect information from the user. The notebook server and its kernel act as the application tier, which is responsible for communicating the user’s request to the DBMS system and send the response from the DBMS to the user through notebook files. The MySQL database is the data tier, where the information processed by the application is stored and managed. Therefore, the jupyter notebook is a three-tier architecture.

# W6

What is the difference between the database schema and the database instance? 
Use the conventions of the relational model for documenting a relation schema to answer the question if:
1. $country\_code$ is the country code for the phone number, e.g. +1
2. $main\_number$ is the main number, e.g. 212-555-1212.
3. $extension$ is the extension, e.g. x1002
4. $phone\_type$ is an enum, e.g. _work, home, mobile, others._
<br><br>

\begin{equation}
PhoneNumber(\underline{country\_code}, \underline{main\_number}, \underline{extension}, phone\_type)
\end{equation}

<br><br>

<u>Answer</u>

Database schema is the logical design of the database, consisting of a list of attributes and their corresponding domains. Database instance is a snapshot of the data in the database at a given instant in time. As provided in the question, the *PhoneNumber* relation has the schema *PhoneNumber(country_code, main_number, extension, phone_type)*. At a certain time, the data stored in the *PhoneNumber* relation is the database instance.

# W7

Briefly explain the differences between:

- Database stored procedure
- Database function
- Database trigger

<u>Answer</u>

A database stored procedure is a subroutine available to applications that access a relational database management system, which is stored in the database data dictionary.<br>
A database function is a specialized database procedure that contain any number of input parameters but only one output parameter. The output parameter represents the result of the database function.<br>
A database trigger is a statement that the system executes automatically as a side effect of a modification to the database.

# W8

Briefly explain:

- Natural join
- Equi-join
- Theta join
- Self-join

<u>Answer</u>

A natural join is a join operation that creates an implicit join by combining tables based on columns with the same name and data type.<br>
An equi join is a type of join that combines tables based on matching values in specified columns.<br>
A theta join is a join that links tables based on a relationship other than equality between two columns.<br>
A self join is a join in which a table is joined with itself.<br><br>
Reference: https://www.w3schools.com/sql/sql_join.asp

# W9

Briefly explain the difference between a _unique (key) constraint_ and a _primary key constraint?_

<u>Answer</u>

1. Primary key constraint requires the primary key can not be null but unique key constraint allows the unique key to have one null value.<br>
2. Primary key constraint allows the primary key to create the cluster index automatically but unique key constraint not.<br>
3. Primary key constraint requires that a table can have only one primary key but unique key constraint allows a table to have more than one unique key.<br><br>
Reference: https://www.geeksforgeeks.org/difference-between-primary-key-and-unique-key/

# W10

Briefly explan _domain constraint_ and give an example.

<u>Answer</u>

Domain constraints are user-defined columns that help the user to enter the value according to the data type. It defines the domain or the set of values for an attribute and ensures that the value taken by the attribute must be an atomic value from its domain.<br>
For example, in the People table from Lahman's Baseball DB, 'playerID' is defined to be of type varchar(9), which is a domain constraint.

# Entity Relationship Model

<u>Question</u>

- This question tests transforming a high-level description of a data model into a more concrete logical ER diagram. You will produce a logical ER-diagram using Lucidchart, or a similar tool. You should use Crow's Foot notation and conventions we have used in lectures.


- The data model is a simple representation of a university.


- The model has the following entity types.
    - School:
        - School code, e.g. "SEAS," "GSAS," "LAW," ... ...
        - School name, e.g. "School of Engineering and Applied Science."
    - Department:
        - Department code, e.g. "COMS," "MATH," "ECON," ... ...
        - Department name, e.g. "Department of Computer Science."
    - Faculty:
        - UNI
        - last_name
        - first_name
        - email
        - title, e.g. "Professor," "Adjunct Professor," ... ...
    - Student:
        - UNI
        - last_name
        - first_name
        - email
    - Course:
        - Course number is a composite key, e.g. "COMSW4111" is
            - Dept. code "COMS"
            - Faculty code "W"
            - Course number "4111"
        - Course title
        - Course description
    - Section:
        - Call number
        - Course number
        - Year
        - Semester
        - Section
        
        
- A Faculty has complex states and relationships.
    - A Faculty can have a role relative to a Department, e.g. Chair.
    - Roles are a small set of possible values.
    - Roles change over time. The data model must support the ability to handle current roles and previous roles.
    - A Faculty can have a role in a department at most once.
    
    
- A Student has a relationship to Section.
    - The possible roles are ```(Enrolled, Waitlist, Dropped, TA)```
    - The student has a current role, and there can be only one current row.
    - The data model must support the ability to handle roles changing over time and retaining information about prior roles.
    
    
- A Faculty _may_ teach a Section. All sections have exactly one Faculty.


- The relationship between Department and School is many-to-many. Each Department is in at least one school and each school has at least one department.
    
    
__Notes:__
1. There is no single correct answer to this question. You will have to make some design decisions and assumptions. You should document your decisions and assumptions.
2. You do not have to worry about __isA__ relationships.
3. You do not have to document or worry about attribute types.
4. The ER diagram must be implementable in the relational/SQL model.

<u>Answer</u>

_Assumptions, Decsions and Notes:_

1. A Department has at least one Course. A Course belongs to exactly one Department.
2. A Department has at least one Student. A Student belongs to exactly one Department.
3. A Faculty may advise a Student. A Student has exactly one advisor from Faculty.
4. A Course has at least one Section. A Section belongs to exactly one Course.
5. School Code can be chosen as the Primary Key of School. Department Code can be chosen as the Priamary Key of Department. UNI can be chosen as the Primary Key of Faculty. UNI can be chosen as the Primary Key of Student. Course Number can be chosen as the Primary Key of Course. Call Number can be chosen as the Primary Key of Section.
6. Course Number can be chosen as the Foreign Key of Section referencing Course Number of Course.
7. Schoold and Department are correlated with a common table School_Dept.
8. Faculty has a role relationship to Department.
9. Student has a role relationship to Section.

# Relational Algebra

## R1

Use the [RelaX Calculator and the Silberschatz - UniversityDB](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) for this question. 

Two time slots _X_ and _Y_ obviously overlap if:
1. They are not the same time slot, i.e. do not have the same $time\_slot\_id$.
2. They have at least one lecture on _the same day,_  the start hour for _X_ is before the start hour for _Y_, and the end hour for _X_ is after the start hour for _Y._
3. To make the question easier, you do not need to consider minutes in computing overlap but must show minutes in the result.

Write the relational algebra expression that identifies obviously overlapping time slots, and only lists overlapping pairs of time slots once. 

Your output must match the answer below. 

<img src='./relational_result.png'>

<u> Answer </u>

```σ X.day=Y.day and X.start_hr < Y.start_hr and X.end_hr > Y.start_hr ((ρ X time_slot) ⨝ X.time_slot_id ≠ Y.time_slot_id (ρ Y time_slot))```

Result:<br>
<img src='./1_relational_query.png'>
<img src='./relational_result.png'>

## R2

1. You __may not__ use the subtraction operator ```-``` to write this query.
2. Produce a relation that:
    - Has column names ```instructor_ID, instructor_name.```
    - Contains the ```ID``` and ```name``` of instructors who do not advise any students.

<u> Answer </u>

```π ID,name (instructor ▷ ID=i_id advisor)```

Result:<br>
<img src='./2_relational_result.png'>

# SQL Schema and DDL

### Objective

- You have a logical datamodel ER-diagram (see below).


- You need to use DDL to define a schema that realizes the model.


- Logical models are not specific enough for direct implementation. This means that:
    - You will have to assign concrete types to columns, and choose things like ```GENERATED,``` ```DEFAULT,``` etc.
    - You may have to decompose a table into two tables, or extract common attributes from multiple tables into a single, referenced table.
    - Implementing the relationships may require adding columns and foreign keys, associative entities, etc.
    - You may have to make other design and implementation choices. <b>This means that there is no single correct answer.</b>

### ER Diagram

| <img src="./er-to-sql-3.png"> |
| :---: |
| __ER Diagram__ |

<u>Answer</u>

Primary keys from all tables are set to be auto-incremented integer.<br>
In table Bill, bill_status may be Paid, UnPaid.<br>
In table Appointment, appt_duration is an integer indicating the duration days.<br>
In table Insurance_Company, phone_no is set to be unique.<br>
In table Insurance_Company, insured_person is added as a foreign key referencing patient_ID in table Patient.<br>

_DDL_

- Execute your DDL in the cell below. You may use DataGrip or other tools to help build the schema.


- You can copy and paste the ```SQL CREATE TABLE``` below, but you MUST execute the statements.

In [23]:
%%sql

create table Physician
(
	physician_ID int auto_increment,
	last_name varchar(128) null,
	first_name varchar(128) null,
	physician_type varchar(3) null,
	constraint Physician_pk
		primary key (physician_ID),
	check ( physician_type in ('NP', 'MD', 'DO') )
);

create table Bill
(
	bill_no int auto_increment,
	amount_insured float default 0 null,
	amount_not_insured float default 0 null,
	bill_total float default 0 null,
	bill_date date null,
	bill_status varchar(10) null,
	constraint Bill_pk
		primary key (bill_no),
	check ( bill_status in ('Paid', 'Unpaid') )
);

create table Appointment
(
	appt_ID int auto_increment,
	appt_date date null,
	appt_time varchar(128) null,
	appt_duration int default 0 null,
	appt_reason varchar(128) null,
	constraint Appointment_pk
		primary key (appt_ID)
);

create table Payment
(
	receipt_no int auto_increment,
	paid_amount float default 0 null,
	paid_date date null,
	paid_type varchar(10) null,
	constraint Payment_pk
		primary key (receipt_no),
	check ( paid_type in ('CC', 'Check', 'Transfer') )
);

create table Patient
(
	patient_ID int auto_increment,
	last_name varchar(128) null,
	first_name varchar(128) null,
	street1 varchar(128) null,
	city varchar(128) null,
	state varchar(128) null,
	postal_code varchar(128) null,
	constraint Patient_pk
		primary key (patient_ID)
);

create table Insurance_Company
(
	company_ID int auto_increment,
	insured_person int null,
	phone_no varchar(128) null,
	street1 varchar(128) null,
	city varchar(128) null,
	state varchar(128) null,
	postal_code varchar(128) null,
	constraint Insurance_Company_pk
		primary key (company_ID),
	constraint Insurance_Company_Patient_patient_ID_fk
		foreign key (insured_person) references Patient (patient_ID)
);

create unique index Insurance_Company_phone_no_uindex
	on Insurance_Company (phone_no);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Complex SQL

### Birth Countries and Death Countries

<u>Question</u>

- In ```lahmansbaseballdb.people``` there is information about people's ```birthCountry``` and ```deathCountry.```



- There are countries in which at least person was born but in which no person has died. 


- Write a query that produces a table of the form:
    - ```birthCountry```
    - ```no_of_births```, which is the total number of births in the country
    
    
- The table contains all rows in which there with births but no deaths.

<u>Answer</u>

In [30]:
%%sql

SELECT birthCountry, COUNT(*) as no_of_births
FROM people
WHERE birthCountry not in (
    SELECT deathCountry
    FROM people
    WHERE deathCountry is not NULL
)
GROUP BY birthCountry
ORDER BY no_of_births DESC;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
35 rows affected.

[('Germany', 45),
 ('Colombia', 24),
 ('South Korea', 23),
 ('Curacao', 15),
 ('Nicaragua', 15),
 ('Russia', 9),
 ('Italy', 7),
 ('Czech Republic', 6),
 ('Brazil', 5),
 ('Poland', 5),
 ('Aruba', 5),
 ('Sweden', 4),
 ('Spain', 4),
 ('Jamaica', 4),
 ('Norway', 3),
 ('Saudi Arabia', 2),
 ('South Africa', 2),
 ('Guam', 2),
 ('Honduras', 2),
 ('Viet Nam', 1),
 ('Greece', 1),
 ('Denmark', 1),
 ('Switzerland', 1),
 ('Singapore', 1),
 ('Belgium', 1),
 ('Peru', 1),
 ('Belize', 1),
 ('Indonesia', 1),
 ('Finland', 1),
 ('Lithuania', 1),
 ('Afghanistan', 1),
 ('Slovakia', 1),
 ('Hong Kong', 1),
 ('Portugal', 1),
 ('Latvia', 1)]

### Best Baseball Players

<u>Question</u>

- This question uses ```lahmansbaseballdb.batting```, ```lahmansbaseballdb.pitching``` and ```lahmansbaseballdb.people```.


- There query computes performance metrics:
    - Batting:
        - On-base percentage: OBP is (sum(h) + sum(BB))/(sum(ab) + sum(BB))
        - Slugging percentage: SLG is        
```
    (
        (sum(h) - sum(`2b`) - sum(`3b`) - sum(hr)) +
        2*sum(`2b`) + 3*sum(`3b`) + 4*sum(`hr`)
    )/sum(ab)
```
        - On-base percentage plus slugging: OPS is is ```(obp + slg)```.
    - Pitching:
        - total_wins is ```sum(w)```.
        - total_loses is ```sum(l)```.
        - win_percentage is ```sum(w)/(sum(w) + sum(l))```.
        
        
- Professor Ferguson has two criteria for someone being a great baseball player.
    - Batting:
        - Total number of ```ab >= 1000```.
        - OPS: Career ```OPS >= 1.000```
    - Pitching:
        - ```(sum(w) + sum(l)) >= 200```.
        - ```win_percentage >= 0.70)``` or ```sum(w) >= 300.```
        
        
- This is one of the rare cases where Prof. Ferguson will provide the answer. So, please produce the table below. Some notes:
    - ```great_because``` is either ```Pitcher``` or ```Batter``` based on whether the player matched the batting or pitching criteria.
    - The values from ```batting``` are ```None``` if the player did not qualify based on batting.
    - The values from ```pitching``` are ```None``` if the player did not qualify on pitching.

<u>Answer</u>

In [186]:
%%sql

CREATE TABLE all_batting as
SELECT playerID, sum(AB) as AB, sum(H) as H, sum(BB) as BB,
sum(2B) as 2B, sum(3B) as 3B, sum(HR) as HR
FROM batting
GROUP BY playerID

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
19689 rows affected.

[]

In [187]:
%%sql

CREATE TABLE batting_metrics as
SELECT 
playerID,
AB,
((H + BB) / (AB + BB)) as obp,
((H + 2B + 2*3B + 3*HR) / AB) as slg,
((H + BB) / (AB + BB) + (H + 2B + 2*3B + 3*HR) / AB) as ops
FROM all_batting

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
19689 rows affected.

[]

In [188]:
%%sql

CREATE TABLE good_batting as
SELECT playerID, obp, slg, ops
FROM batting_metrics
WHERE (AB >= 1000 and ops >= 1)

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
7 rows affected.

[]

In [196]:
%%sql

CREATE TABLE all_pitching as
SELECT playerID, sum(W) as total_wins, sum(L) as total_loses
FROM pitching
GROUP BY playerID

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
9845 rows affected.

[]

In [211]:
%%sql

CREATE TABLE pitching_metrics as
SELECT 
playerID, total_wins, total_loses,
(total_wins / (total_wins + total_loses)) as win_percent
FROM all_pitching

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
9845 rows affected.

[]

In [213]:
%%sql

CREATE TABLE good_pitching as
SELECT playerID, total_wins, total_loses, win_percent
FROM pitching_metrics
WHERE (total_wins + total_loses >= 200 and (win_percent >= 0.7 or total_wins >= 300))

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
25 rows affected.

[]

In [201]:
%%sql

CREATE TABLE all_people as
SELECT playerID, nameLast, nameFirst, debut as debut_date, finalGame as finalgame_date
FROM people

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
19878 rows affected.

[]

In [207]:
%%sql

CREATE TABLE batting_result as
SELECT all_people.playerID as playerid, nameLast, nameFirst, 'Batter' as great_because,
debut_date, finalgame_date, good_batting.playerID as playerid_1, obp, slg, ops
FROM all_people JOIN good_batting
WHERE all_people.playerID = good_batting.playerID

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
7 rows affected.

[]

In [215]:
%%sql

CREATE TABLE pitching_result as
SELECT all_people.playerID as playerid, nameLast, nameFirst, 'Pitcher' as great_because,
debut_date, finalgame_date, good_pitching.playerID as playerid_1, total_wins, total_loses, win_percent
FROM all_people JOIN good_pitching
WHERE all_people.playerID = good_pitching.playerID

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
25 rows affected.

[]

In [244]:
%%sql

SELECT *
FROM batting_result NATURAL LEFT OUTER JOIN pitching_result
UNION
SELECT playerid, nameLast, nameFirst, great_because, debut_date,
finalgame_date, playerid_1, obp, slg, ops, total_wins, total_loses, win_percent
FROM batting_result NATURAL RIGHT OUTER JOIN pitching_result

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
32 rows affected.

[('bondsba01', 'Bonds', 'Barry', 'Batter', '1986-05-30', '2007-09-26', 'bondsba01', Decimal('0.4428'), Decimal('0.6069'), Decimal('1.0497'), None, None, None),
 ('foxxji01', 'Foxx', 'Jimmie', 'Batter', '1925-05-01', '1945-09-23', 'foxxji01', Decimal('0.4275'), Decimal('0.6093'), Decimal('1.0368'), None, None, None),
 ('gehrilo01', 'Gehrig', 'Lou', 'Batter', '1923-06-15', '1939-04-30', 'gehrilo01', Decimal('0.4447'), Decimal('0.6324'), Decimal('1.0772'), None, None, None),
 ('greenha01', 'Greenberg', 'Hank', 'Batter', '1930-09-14', '1947-09-18', 'greenha01', Decimal('0.4103'), Decimal('0.6050'), Decimal('1.0153'), None, None, None),
 ('hornsro01', 'Hornsby', 'Rogers', 'Batter', '1915-09-10', '1937-07-20', 'hornsro01', Decimal('0.4308'), Decimal('0.5765'), Decimal('1.0073'), None, None, None),
 ('ruthba01', 'Ruth', 'Babe', 'Batter', '1914-07-11', '1935-05-30', 'ruthba01', Decimal('0.4718'), Decimal('0.6898'), Decimal('1.1616'), None, None, None),
 ('willite01', 'Williams', 'Ted', 'Batter', '1939-04-20', '1960-09-28', 'willite01', Decimal('0.4806'), Decimal('0.6338'), Decimal('1.1144'), None, None, None),
 ('alexape01', 'Alexander', 'Pete', 'Pitcher', '1911-04-15', '1930-05-28', 'alexape01', None, None, None, Decimal('373'), Decimal('208'), Decimal('0.6420')),
 ('carltst01', 'Carlton', 'Steve', 'Pitcher', '1965-04-12', '1988-04-23', 'carltst01', None, None, None, Decimal('329'), Decimal('244'), Decimal('0.5742')),
 ('clarkjo01', 'Clarkson', 'John', 'Pitcher', '1882-05-02', '1894-07-12', 'clarkjo01', None, None, None, Decimal('328'), Decimal('178'), Decimal('0.6482')),
 ('clemero02', 'Clemens', 'Roger', 'Pitcher', '1984-05-15', '2007-09-16', 'clemero02', None, None, None, Decimal('354'), Decimal('184'), Decimal('0.6580')),
 ('galvipu01', 'Galvin', 'Pud', 'Pitcher', '1875-05-22', '1892-08-02', 'galvipu01', None, None, None, Decimal('365'), Decimal('310'), Decimal('0.5407')),
 ('glavito02', 'Glavine', 'Tom', 'Pitcher', '1987-08-17', '2008-08-14', 'glavito02', None, None, None, Decimal('305'), Decimal('203'), Decimal('0.6004')),
 ('grovele01', 'Grove', 'Lefty', 'Pitcher', '1925-04-14', '1941-09-28', 'grovele01', None, None, None, Decimal('300'), Decimal('141'), Decimal('0.6803')),
 ('johnsra05', 'Johnson', 'Randy', 'Pitcher', '1988-09-15', '2009-10-04', 'johnsra05', None, None, None, Decimal('303'), Decimal('166'), Decimal('0.6461')),
 ('johnswa01', 'Johnson', 'Walter', 'Pitcher', '1907-08-02', '1927-09-30', 'johnswa01', None, None, None, Decimal('417'), Decimal('279'), Decimal('0.5991')),
 ('keefeti01', 'Keefe', 'Tim', 'Pitcher', '1880-08-06', '1893-08-15', 'keefeti01', None, None, None, Decimal('342'), Decimal('225'), Decimal('0.6032')),
 ('maddugr01', 'Maddux', 'Greg', 'Pitcher', '1986-09-03', '2008-09-27', 'maddugr01', None, None, None, Decimal('355'), Decimal('227'), Decimal('0.6100')),
 ('mathech01', 'Mathewson', 'Christy', 'Pitcher', '1900-07-17', '1916-09-04', 'mathech01', None, None, None, Decimal('373'), Decimal('188'), Decimal('0.6649')),
 ('nichoki01', 'Nichols', 'Kid', 'Pitcher', '1890-04-23', '1906-05-18', 'nichoki01', None, None, None, Decimal('362'), Decimal('208'), Decimal('0.6351')),
 ('niekrph01', 'Niekro', 'Phil', 'Pitcher', '1964-04-15', '1987-09-27', 'niekrph01', None, None, None, Decimal('318'), Decimal('274'), Decimal('0.5372')),
 ('perryga01', 'Perry', 'Gaylord', 'Pitcher', '1962-04-14', '1983-09-21', 'perryga01', None, None, None, Decimal('314'), Decimal('265'), Decimal('0.5423')),
 ('planked01', 'Plank', 'Eddie', 'Pitcher', '1901-05-13', '1917-08-06', 'planked01', None, None, None, Decimal('326'), Decimal('194'), Decimal('0.6269')),
 ('radboch01', 'Radbourn', 'Old Hoss', 'Pitcher', '1880-05-05', '1891-08-11', 'radboch01', None, None, None, Decimal('310'), Decimal('194'), Decimal('0.6151')),
 ('ryanno01', 'Ryan', 'Nolan', 'Pitcher', '1966-09-11', '1993-09-22', 'ryanno01', None, None, None, Decimal('324'), Decimal('292'), Decimal('0.5260')),
 ('seaveto01', 'Seaver', 'Tom', 'Pitcher', '1967-04-13', '1986-09-19', 'seaveto01', None, None, None, Decimal('311'), Decimal('205'), Decimal('0.6027')),
 ('spahnwa01', 'Spahn', 'Warren', 'Pitcher', '1942-04-19', '1965-10-01', 'spahnwa01', None, None, None, Decimal('363'), Decimal('245'), Decimal('0.5970')),
 ('spaldal01', 'Spalding', 'Al', 'Pitcher', '1871-05-05', '1878-08-31', 'spaldal01', None, None, None, Decimal('252'), Decimal('65'), Decimal('0.7950')),
 ('suttodo01', 'Sutton', 'Don', 'Pitcher', '1966-04-14', '1988-08-09', 'suttodo01', None, None, None, Decimal('324'), Decimal('256'), Decimal('0.5586')),
 ('welchmi01', 'Welch', 'Mickey', 'Pitcher', '1880-05-01', '1892-05-17', 'welchmi01', None, None, None, Decimal('307'), Decimal('210'), Decimal('0.5938')),
 ('wynnea01', 'Wynn', 'Early', 'Pitcher', '1939-09-13', '1963-09-13', 'wynnea01', None, None, None, Decimal('300'), Decimal('244'), Decimal('0.5515')),
 ('youngcy01', 'Young', 'Cy', 'Pitcher', '1890-08-06', '1911-10-06', 'youngcy01', None, None, None, Decimal('511'), Decimal('315'), Decimal('0.6186'))]

### Putting Together DDL, DML, Functions, Triggers

<u>Question</u>

- Use the database that comes with the textbook for this question.
    - Create a new database ```db_book_midterm.```
    - Copy the data and table definitions for ```Student``` and ```Instructor```
    - You may have to remove some constraints from the copied data/definition to make it work.


- Base tables:
    - ```Student``` has the form ```Student(ID, name, dept_name, total_cred)```.
    - ```Instructor``` has the form ```Instructor(ID, name, dept_name, salary)```.
    
    
- There is a _logical_ base type ```Person.``` The logical ```isA``` model is:


| <img src='./oo-model.png'> |
| :---: |
| __Logical Model__ |



- ```role``` is either ```S``` or ```I``` based on whether the ```Person``` is a ```Student``` or ```Instructor```.


- Implement a _two table_ solution to realize ```Person.``` This means define ```Person``` as a view.


- You do not need to worry about generating the primary key ID. Your implementation MUST, however, enforce the rule that the ID is immutable.



- You must also create a _stored procedure_ ```create_person```. The template for the implementation is:

```
CREATE DEFINER=`root`@`localhost` PROCEDURE `create_person`(
	in person_name varchar(32),
    in dept_name varchar(32),
    in total_cred decimal(3,0),
    in salary decimal(8,2),
    out ID varchar(5)
    )
BEGIN

	declare bad_person boolean;
    declare new_id varchar(12);
    
    set bad_person = false;
    set new_id = '00000';
    
    
    /*
		The logic of the stored procedure is the following:
			- The request is invalid and sets bad_person to true if:
				- Any of person_name, dept_name is NULL.
                - Either total_cred is NULL and salary is NOT NULL, or salary is NULL and total_cred is NULL. 
			- The procedure must compute a new, unique ID. The approach is to find the manimum
                ID value over Student and Instructor. Add 1 to the value to produce the new, unique ID.
            - The procedure then adds the information to Student or Instructor based on whether
                total_cred is NULL or salary is NULL.
    */
    
    /* <YOUR CODE GOES HERE> */
    
    if bad_person is true then
		SIGNAL SQLSTATE '50001'
			SET MESSAGE_TEXT = 'Invalid Person information input';
	end if;
    
    /* NOTE: ID is the out parameter. You must set ID to the new, unique ID */

END
```

<u>Answer</u>

In [403]:
%sql mysql+pymysql://admin:7Senses_kiki@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm

_Create view statement_

In [408]:
%%sql

CREATE VIEW Person as
SELECT ID, name, dept_name, 'I' as role FROM instructor
UNION
SELECT ID, name, dept_name, 'S' as role FROM student

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.

[]

_Create procedure statement_

In [410]:
%%sql

CREATE DEFINER='admin'@'%' PROCEDURE create_person(
    in person_name varchar(32),
    in dept_name varchar(32),
    in total_cred decimal(3,0),
    in salary decimal(8,2),
    out out_ID varchar(5)
    )
BEGIN

    declare bad_person boolean;
    declare new_id varchar(12);

    set bad_person = false;
    set new_id = '00000';


    /*
        The logic of the stored procedure is the following:
            - The request is invalid and sets bad_person to true if:
                - Any of person_name, dept_name is NULL.
                - Either total_cred is NULL and salary is NOT NULL, or salary is NULL and total_cred is NULL. 
            - The procedure must compute a new, unique ID. The approach is to find the manimum
                ID value over Student and Instructor. Add 1 to the value to produce the new, unique ID.
            - The procedure then adds the information to Student or Instructor based on whether
                total_cred is NULL or salary is NULL.
    */

    if person_name is NULL or dept_name is NULL then
        set bad_person = true;
    end if;
    
    if total_cred is NULL and salary is NULL then
        set bad_person = true;
    end if;
    
    if total_cred is not NULL and salary is not NULL then
        set bad_person = true;
    end if;

    if bad_person is true then
        SIGNAL SQLSTATE '50001'
            SET MESSAGE_TEXT = 'Invalid Person information input';
    end if;
    
    SELECT MAX(ID)+1 INTO out_ID FROM Person;
    
    if total_cred is not NULL then
        INSERT INTO student (ID, name, dept_name, tot_cred)
        VALUES (out_ID, person_name, dept_name, total_cred);
    end if;
    
    if salary is not NULL then
        INSERT INTO instructor (ID, name, dept_name, salary)
        VALUES (out_ID, person_name, dept_name, salary);
    end if;


    /* NOTE: ID is the out parameter. You must set ID to the new, unique ID */

END

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.

[]

_Tests_

Run the SQL in the following cells to test your solution.

- Test 1: Show the view.

In [413]:
%sql select * from Person;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
25 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', 'I'),
 ('12121', 'Wu', 'Finance', 'I'),
 ('15151', 'Mozart', 'Music', 'I'),
 ('22222', 'Einstein', 'Physics', 'I'),
 ('32343', 'El Said', 'History', 'I'),
 ('33456', 'Gold', 'Physics', 'I'),
 ('45565', 'Katz', 'Comp. Sci.', 'I'),
 ('58583', 'Califieri', 'History', 'I'),
 ('76543', 'Singh', 'Finance', 'I'),
 ('76766', 'Crick', 'Biology', 'I'),
 ('83821', 'Brandt', 'Comp. Sci.', 'I'),
 ('98345', 'Kim', 'Elec. Eng.', 'I'),
 ('00128', 'Zhang', 'Comp. Sci.', 'S'),
 ('12345', 'Shankar', 'Comp. Sci.', 'S'),
 ('19991', 'Brandt', 'History', 'S'),
 ('23121', 'Chavez', 'Finance', 'S'),
 ('44553', 'Peltier', 'Physics', 'S'),
 ('45678', 'Levy', 'Physics', 'S'),
 ('54321', 'Williams', 'Comp. Sci.', 'S'),
 ('55739', 'Sanchez', 'Music', 'S'),
 ('70557', 'Snow', 'Physics', 'S'),
 ('76543', 'Brown', 'Comp. Sci.', 'S'),
 ('76653', 'Aoi', 'Elec. Eng.', 'S'),
 ('98765', 'Bourikas', 'Elec. Eng.', 'S'),
 ('98988', 'Tanaka', 'Biology', 'S')]

_Create an Instructor and Student_

In [414]:
%sql CALL create_person('Ferguson', 'Comp. Sci.',  NULL, 30000.00, @prof_id);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
1 rows affected.

[]

In [415]:
%sql SELECT @prof_id;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
1 rows affected.

[('98989',)]

In [416]:
%sql CALL create_person('Ferguson', 'Comp. Sci.',  100.0, NULL, @student_id);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
1 rows affected.

[]

In [417]:
%sql SELECT @student_id;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
1 rows affected.

[('98990',)]

- Try an error

In [418]:
try:
    %sql CALL create_person('Ferguson', 'Comp. Sci.',  100.0, 30000, @student_id);
except Exception as e:
    print(e)
res = %sql select @student_id;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
(pymysql.err.OperationalError) (1644, 'Invalid Person information input')
[SQL: CALL create_person('Ferguson', 'Comp. Sci.' , 100.0, 30000, @student_id);]
(Background on this error at: http://sqlalche.me/e/e3q8)
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
1 rows affected.

_Include DDL that Show Enforcing Immutable ID_

In [426]:
%%sql

DROP TRIGGER immutable_student_id;
DROP TRIGGER immutable_instructor_id;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.
0 rows affected.

[]

In [427]:
%%sql

CREATE DEFINER='admin'@'%' TRIGGER immutable_student_id BEFORE UPDATE ON student
FOR EACH ROW
BEGIN
    IF NEW.ID != OLD.ID THEN
       SET NEW.ID = OLD.ID;
        SIGNAL SQLSTATE '50001'
            SET MESSAGE_TEXT = 'Not allowed to change column ID of student';
    END IF;
END;

CREATE DEFINER='admin'@'%' TRIGGER immutable_instructor_id BEFORE UPDATE ON instructor
FOR EACH ROW
BEGIN
    IF NEW.ID != OLD.ID THEN
       SET NEW.ID = OLD.ID;
        SIGNAL SQLSTATE '50001'
            SET MESSAGE_TEXT = 'Not allowed to change column ID of instructor';
    END IF;
END;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.
0 rows affected.

[]

_Write a test that shows you implemented immutable IDs_

In [431]:
%%sql

UPDATE student
SET ID = '12345'
WHERE name = 'Aoi';

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
(pymysql.err.OperationalError) (1644, 'Not allowed to change column ID of student')
[SQL: UPDATE student SET ID = '12345'
WHERE name = 'Aoi';]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [432]:
%%sql

UPDATE instructor
SET ID = '12345'
WHERE name = 'Wu';

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
(pymysql.err.OperationalError) (1644, 'Not allowed to change column ID of instructor')
[SQL: UPDATE instructor SET ID = '12345'
WHERE name = 'Wu';]
(Background on this error at: http://sqlalche.me/e/e3q8)

# Data and Schema Cleanup

## Part 1 $-$ Countries and Cities

- There is a file  ```worldcities``` in the same folder as this notebook.


- In the following code cell, use Pandas to:
    - Read the CSV file into a Data Frame.
    - Convert the Data Frame to contain only the following columns:
        - ```city```
        - ```city_ascii```
        - ```lat```
        - ```lng```
        - ```country```
        - ```iso2```
        - ```iso3```
        - ```id```
    - Write the data to the table ```worldcities``` in the schema ```F21W4111Midterm.```
    
    
- Use the SQL after the code cell to display part of your new table.


<u>Answer</u>

In [435]:
df = pd.read_csv ('worldcities.csv')
df = df[['city', 'city_ascii', 'lat', 'lng', 'country', 'iso2', 'iso3', 'id']]
df

,city,city_ascii,lat,lng,country,iso2,iso3,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,1392685764
1,Jakarta,Jakarta,-6.2146,106.8451,Indonesia,ID,IDN,1360771077
2,Delhi,Delhi,28.6600,77.2300,India,IN,IND,1356872604
3,Mumbai,Mumbai,18.9667,72.8333,India,IN,IND,1356226629
4,Manila,Manila,14.6000,120.9833,Philippines,PH,PHL,1608618140
...,...,...,...,...,...,...,...,...
40996,Tukchi,Tukchi,57.3670,139.5000,Russia,RU,RUS,1643472801
40997,Numto,Numto,63.6667,71.3333,Russia,RU,RUS,1643985006
40998,Nord,Nord,81.7166,-17.8000,Greenland,GL,GRL,1304217709
40999,Timmiarmiut,Timmiarmiut,62.5333,-42.2167,Greenland,GL,GRL,1304206491
41000,Nordvik,Nordvik,74.0165,111.5100,Russia,RU,RUS,1643587468

In [452]:
sql_engine = create_engine("mysql+pymysql://admin:7Senses_kiki@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm")

In [454]:
df.to_sql('worldcities', con=sql_engine, if_exists='replace', index=False)


- Display data.

In [455]:
%sql select * from F21Midterm.worldcities order by city limit 30;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
30 rows affected.

[('‘Adrā', '`Adra', 33.6, 36.515, 'Syria', 'SY', 'SYR', 1760640037),
 ('‘Ajlūn', '`Ajlun', 32.3325, 35.7517, 'Jordan', 'JO', 'JOR', 1400775371),
 ('‘Ajmān', '`Ajman', 25.3994, 55.4797, 'United Arab Emirates', 'AE', 'ARE', 1784337875),
 ('‘Akko', '`Akko', 32.9261, 35.0839, 'Israel', 'IL', 'ISR', 1376781950),
 ('‘Alavīcheh', '`Alavicheh', 33.0528, 51.0825, 'Iran', 'IR', 'IRN', 1364605877),
 ('‘Amrān', '`Amran', 15.6594, 43.9439, 'Yemen', 'YE', 'YEM', 1887433410),
 ('‘Āmūdā', '`Amuda', 37.1042, 40.93, 'Syria', 'SY', 'SYR', 1760247135),
 ('‘Anadān', '`Anadan', 36.2936, 37.0444, 'Syria', 'SY', 'SYR', 1760993442),
 ('‘Assāl al Ward', '`Assal al Ward', 33.8658, 36.4133, 'Syria', 'SY', 'SYR', 1760181042),
 ('‘Ataq', '`Ataq', 14.55, 46.8, 'Yemen', 'YE', 'YEM', 1887172893),
 ('‘Ayn ‘Īsá', '`Ayn `Isa', 36.3858, 38.8472, 'Syria', 'SY', 'SYR', 1760078370),
 ('‘Ibrī', '`Ibri', 23.2254, 56.517, 'Oman', 'OM', 'OMN', 1512077267),
 ('’Aïn Abessa', "'Ain Abessa", 36.3, 5.295, 'Algeria', 'DZ', 'DZA', 1012074116),
 ('’Aïn Arnat', "'Ain Arnat", 36.1833, 5.3167, 'Algeria', 'DZ', 'DZA', 1012453452),
 ('’Aïn Azel', "'Ain Azel", 35.8433, 5.5219, 'Algeria', 'DZ', 'DZA', 1012746080),
 ('’Aïn el Hammam', "'Ain el Hammam", 36.5647, 4.3061, 'Algeria', 'DZ', 'DZA', 1012595495),
 ('’Aïn Leuh', "'Ain Leuh", 33.2833, -5.3833, 'Morocco', 'MA', 'MAR', 1504668626),
 ('’Aïn Roua', "'Ain Roua", 36.3344, 5.1806, 'Algeria', 'DZ', 'DZA', 1012529757),
 ('’Ali Ben Sliman', "'Ali Ben Sliman", 31.9053, -7.2144, 'Morocco', 'MA', 'MAR', 1504127885),
 ('’Ayn Bni Mathar', "'Ayn Bni Mathar", 34.0889, -2.0247, 'Morocco', 'MA', 'MAR', 1504845272),
 ('’s-Hertogenbosch', "'s-Hertogenbosch", 51.6833, 5.3167, 'Netherlands', 'NL', 'NLD', 1528012333),
 ('A Coruña', 'A Coruna', 43.3713, -8.4188, 'Spain', 'ES', 'ESP', 1724417375),
 ('Aachen', 'Aachen', 50.7762, 6.0838, 'Germany', 'DE', 'DEU', 1276805572),
 ('Aadorf', 'Aadorf', 47.4939, 8.8975, 'Switzerland', 'CH', 'CHE', 1756022542),
 ('Aalborg', 'Aalborg', 57.0337, 9.9166, 'Denmark', 'DK', 'DNK', 1208789278),
 ('Aalen', 'Aalen', 48.8372, 10.0936, 'Germany', 'DE', 'DEU', 1276757787),
 ('Aalsmeer', 'Aalsmeer', 52.2639, 4.7625, 'Netherlands', 'NL', 'NLD', 1528899853),
 ('Aalst', 'Aalst', 50.9333, 4.0333, 'Belgium', 'BE', 'BEL', 1056695813),
 ('Aalten', 'Aalten', 51.925, 6.5808, 'Netherlands', 'NL', 'NLD', 1528326020),
 ('Äänekoski', 'Aanekoski', 62.6042, 25.7264, 'Finland', 'FI', 'FIN', 1246710490)]

## P2 $-$ Modify World City Data

- Having multiple rows that repeat ```country, iso2``` and ```iso3``` is a poor design.


- Create two new tables:
    - ```countries``` that contains ```country, iso2``` and ```iso3.```
    - ```cities``` that contains only the remaining fields.
    - Pick either ```iso2``` or ```iso3``` to define a foreign key between the tables.
    
    
- Add primary keys, unique keys, select column data types, etc. to define a better schema for the two tables.
    
    
- Show you SQL statements for creating and modifying the tables below.


- __Note:__ A small number of the ISO2 and ISO3 codes are incorrect and will prevent creating keys. You must correct this data.


- Show you DDL below.

<u>Answer</u>

In [473]:
%%sql

ALTER TABLE worldcities MODIFY country varchar(128);
ALTER TABLE worldcities MODIFY iso2 varchar(2);
ALTER TABLE worldcities MODIFY iso3 varchar(3);
ALTER TABLE worldcities MODIFY city varchar(128);
ALTER TABLE worldcities MODIFY city_ascii varchar(128);
ALTER TABLE worldcities MODIFY lat varchar(128);
ALTER TABLE worldcities MODIFY lng varchar(128);
ALTER TABLE worldcities MODIFY id varchar(128);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
41001 rows affected.
41001 rows affected.
41001 rows affected.
41001 rows affected.
41001 rows affected.
41001 rows affected.
41001 rows affected.
41001 rows affected.

[]

In [475]:
%%sql

ALTER TABLE worldcities ADD PRIMARY KEY (id);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
41001 rows affected.

[]

In [481]:
%%sql

CREATE INDEX iso2
ON worldcities (iso2);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.

[]

In [476]:
%%sql

CREATE TABLE countries as
SELECT DISTINCT country, iso2, iso3
FROM worldcities;

CREATE TABLE cities as
SELECT DISTINCT city, city_ascii, lat, lng, id
FROM worldcities;

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
237 rows affected.
41001 rows affected.

[]

In [478]:
%%sql

UPDATE countries
SET iso3 = 'ARM'
WHERE country = 'Armenia';

ALTER TABLE countries ADD PRIMARY KEY (iso3);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
1 rows affected.
237 rows affected.

[]

In [479]:
%%sql

ALTER TABLE countries ADD UNIQUE (country);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.

[]

In [482]:
%%sql

ALTER TABLE countries
ADD FOREIGN KEY (iso2) REFERENCES worldcities(iso2);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
237 rows affected.

[]

In [483]:
%%sql

ALTER TABLE cities ADD PRIMARY KEY (id);

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.

[]

## P3 $-$ An Easy Question

- An interesting question. Is there a better SQL type for latitude and longitude than ```DOUBLE```? If you think there is a better type, what would it be? (You do not need to perform any conversions)

<u>Answer</u>

I think DECIMAL(p,s) is a better type than DOUBLE cause it can hold more digits and preserves more precison.

In [495]:
%%sql

ALTER TABLE worldcities ADD new_lat DECIMAL(6, 4);
ALTER TABLE worldcities ADD new_lng DECIMAL(6, 4);

UPDATE worldcities SET new_lat = lat;
UPDATE worldcities SET new_lng = lng;

SELECT id, city, city_ascii, lat, lng, iso3, new_lat, new_lng
FROM worldcities LIMIT 20

   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com
 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/db_book_midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.
0 rows affected.
41001 rows affected.
41001 rows affected.
20 rows affected.

[('1004003059', 'Kandahār', 'Kandahar', '31.6078', '65.7053', 'AFG', Decimal('31.6078'), Decimal('65.7053')),
 ('1004016690', 'Qalāt', 'Qalat', '32.1061', '66.9069', 'AFG', Decimal('32.1061'), Decimal('66.9069')),
 ('1004047427', 'Sar-e Pul', 'Sar-e Pul', '36.2214', '65.9278', 'AFG', Decimal('36.2214'), Decimal('65.9278')),
 ('1004123527', 'Pul-e Khumrī', 'Pul-e Khumri', '35.95', '68.7', 'AFG', Decimal('35.9500'), Decimal('68.7000')),
 ('1004151943', 'Maḩmūd-e Rāqī', 'Mahmud-e Raqi', '35.0167', '69.3333', 'AFG', Decimal('35.0167'), Decimal('69.3333')),
 ('1004167490', 'Ghaznī', 'Ghazni', '33.5492', '68.4233', 'AFG', Decimal('33.5492'), Decimal('68.4233')),
 ('1004180853', 'Pul-e ‘Alam', 'Pul-e `Alam', '33.9953', '69.0227', 'AFG', Decimal('33.9953'), Decimal('69.0227')),
 ('1004227517', 'Kunduz', 'Kunduz', '36.728', '68.8725', 'AFG', Decimal('36.7280'), Decimal('68.8725')),
 ('1004237782', 'Herāt', 'Herat', '34.3738', '62.1792', 'AFG', Decimal('34.3738'), Decimal('62.1792')),
 ('1004251962', 'Asadābād', 'Asadabad', '34.8742', '71.1528', 'AFG', Decimal('34.8742'), Decimal('71.1528')),
 ('1004273142', 'Sharan', 'Sharan', '33.1757', '68.7304', 'AFG', Decimal('33.1757'), Decimal('68.7304')),
 ('1004274041', 'Bāmyān', 'Bamyan', '34.8167', '67.8167', 'AFG', Decimal('34.8167'), Decimal('67.8167')),
 ('1004315012', 'Jalālābād', 'Jalalabad', '34.4303', '70.4528', 'AFG', Decimal('34.4303'), Decimal('70.4528')),
 ('1004374554', 'Bāzārak', 'Bazarak', '35.3129', '69.5152', 'AFG', Decimal('35.3129'), Decimal('69.5152')),
 ('1004436363', 'Mazār-e Sharīf', 'Mazar-e Sharif', '36.7', '67.1167', 'AFG', Decimal('36.7000'), Decimal('67.1167')),
 ('1004450357', 'Kōṯah-ye ‘As̲h̲rō', 'Kotah-ye `Ashro', '34.45', '68.8', 'AFG', Decimal('34.4500'), Decimal('68.8000')),
 ('1004452653', 'Faīẕābād', 'Faizabad', '37.1298', '70.5792', 'AFG', Decimal('37.1298'), Decimal('70.5792')),
 ('1004468894', 'Gardēz', 'Gardez', '33.5931', '69.2297', 'AFG', Decimal('33.5931'), Decimal('69.2297')),
 ('1004472345', 'Andkhōy', 'Andkhoy', '36.95', '65.1167', 'AFG', Decimal('36.9500'), Decimal('65.1167')),
 ('1004472874', 'Buynī Qarah', 'Buyni Qarah', '36.3172', '66.8747', 'AFG', Decimal('36.3172'), Decimal('66.8747'))]

## FInal Create Table Statements

- Use the DataGrip tool to generate final ```CREATE TABLE``` statements below. You do not need to execute the statements.



<u>Answer</u>

In [6]:
%sql mysql+pymysql://admin:7Senses_kiki@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm

## Fixing People Table

<u>Create a Copy People</u>

- Create a table ```F21Midterm.people_modified``` that has the same schema and data as ```lahmansbaseballdb.people```.


- SQL:

<u>Answer</u>

In [10]:
%%sql

CREATE TABLE people_modified LIKE lahmansbaseballdb.people;
INSERT INTO people_modified SELECT * FROM lahmansbaseballdb.people;

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.
19878 rows affected.

[]

<u>Fixing ```birthCountry```</u>

- The query below indicates that some ```birthCountry``` entries in ```people``` do not map to a know country.

In [11]:
%%sql


select distinct birthCountry, count(*) as count from people_modified where
	birthCountry not in (select country from countries)
    group by birthCountry;

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
10 rows affected.

[('USA', 17254),
 ('D.R.', 761),
 ('CAN', 255),
 ('P.R.', 268),
 ('Bahamas', 6),
 ('South Korea', 23),
 ('Czech Republic', 6),
 ('V.I.', 14),
 ('Viet Nam', 1),
 ('At Sea', 1)]

- My proposed corrections for ```birthCountry``` are:

| birthCountry   | ISO3 | ISO2 | Correct Country Name |
|----------------|------|------|----------------------|
| Bahamas        | BHS  | BS   | Bahamas, The         |
| CAN            | CAN  | CA   | Canada               |
| Czech Republic | CZE  | CZ   | Czechia              |
| South Korea    | KOR  | KR   | Korea, South         |
| USA            | USA  | US   | United States        |
| Viet Nam       | VNM  | VN   | Vietnam              |
| D.R.           | DOM  | DO   | Dominican Republic   |
| P.R.           | PRI  | PR   | Puerto Rico          |
| V.I.           | USA  | US   | United States        |
| At Sea         | NULL | NULL | NULL                 |


- Correct ```people_modified```, making the following changes:
    1. Add a column ```birthCountryISO3```
    2. Correct the entries for ```birthCountry.```
    3. Populate the values for ```birthCountryISO3```
    4. Set up a foreign key relationship from ```people_modified``` to ```countries.```
    5. Drop the column ```birthCountry.```

<u>Answer</u>

- Show your SQL statements for altering the table below.

In [13]:
%%sql

ALTER TABLE people_modified
ADD birthCountryISO3 varchar(3);

ALTER TABLE people_modified
ADD birthCountryISO2 varchar(2);

ALTER TABLE people_modified
ADD Correct_Country_Name varchar(128);

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [16]:
%%sql

UPDATE people_modified
SET Correct_Country_Name = birthCountry;

UPDATE people_modified
SET Correct_Country_Name='Bahamas, The'
WHERE birthCountry='Bahamas';

UPDATE people_modified
SET Correct_Country_Name='Canada'
WHERE birthCountry='CAN';

UPDATE people_modified
SET Correct_Country_Name='Czechia'
WHERE birthCountry='Czech Republic';

UPDATE people_modified
SET Correct_Country_Name='Korea, South'
WHERE birthCountry='South Korea';

UPDATE people_modified
SET Correct_Country_Name='United States'
WHERE birthCountry='USA';

UPDATE people_modified
SET Correct_Country_Name='Vietnam'
WHERE birthCountry='Viet Nam';

UPDATE people_modified
SET Correct_Country_Name='Dominican Republic'
WHERE birthCountry='D.R.';

UPDATE people_modified
SET Correct_Country_Name='Puerto Rico'
WHERE birthCountry='P.R.';

UPDATE people_modified
SET Correct_Country_Name='United States'
WHERE birthCountry='V.I.';

UPDATE people_modified
SET Correct_Country_Name='NULL'
WHERE birthCountry='At Sea';

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
19878 rows affected.
6 rows affected.
255 rows affected.
6 rows affected.
23 rows affected.
17254 rows affected.
1 rows affected.
761 rows affected.
268 rows affected.
14 rows affected.
1 rows affected.

[]

In [20]:
%%sql

UPDATE people_modified 
SET birthCountryISO3 = 
(SELECT iso3 FROM countries WHERE people_modified.Correct_Country_Name=countries.country);

UPDATE people_modified 
SET people_modified.birthCountryISO2 =
(SELECT iso2 FROM countries WHERE people_modified.Correct_Country_Name=countries.country);

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
19878 rows affected.
19878 rows affected.

[]

In [21]:
%%sql

ALTER TABLE people_modified
ADD CONSTRAINT FK_ISO3
FOREIGN KEY (birthCountryISO3) REFERENCES countries(iso3);

ALTER TABLE people_modified
DROP COLUMN birthCountry;

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
19878 rows affected.
0 rows affected.

[]

- Run a couple of queries to show correctly modified table.

In [24]:
%%sql

SELECT * FROM people_modified LIMIT 10

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
10 rows affected.

[('aardsda01', 1981, 12, 27, 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215, 75, 'R', 'R', '2004-04-06', '2015-08-23', 'aardd001', 'aardsda01', datetime.date(1981, 12, 27), datetime.date(2004, 4, 6), datetime.date(2015, 8, 23), None, 'USA', 'US', 'United States'),
 ('aaronha01', 1934, 2, 5, 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', 180, 72, 'R', 'R', '1954-04-13', '1976-10-03', 'aaroh101', 'aaronha01', datetime.date(1934, 2, 5), datetime.date(1954, 4, 13), datetime.date(1976, 10, 3), None, 'USA', 'US', 'United States'),
 ('aaronto01', 1939, 8, 5, 'AL', 'Mobile', 1984, 8, 16, 'USA', 'GA', 'Atlanta', 'Tommie', 'Aaron', 'Tommie Lee', 190, 75, 'R', 'R', '1962-04-10', '1971-09-26', 'aarot101', 'aaronto01', datetime.date(1939, 8, 5), datetime.date(1962, 4, 10), datetime.date(1971, 9, 26), datetime.date(1984, 8, 16), 'USA', 'US', 'United States'),
 ('aasedo01', 1954, 9, 8, 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190, 75, 'R', 'R', '1977-07-26', '1990-10-03', 'aased001', 'aasedo01', datetime.date(1954, 9, 8), datetime.date(1977, 7, 26), datetime.date(1990, 10, 3), None, 'USA', 'US', 'United States'),
 ('abadan01', 1972, 8, 25, 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184, 73, 'L', 'L', '2001-09-10', '2006-04-13', 'abada001', 'abadan01', datetime.date(1972, 8, 25), datetime.date(2001, 9, 10), datetime.date(2006, 4, 13), None, 'USA', 'US', 'United States'),
 ('abadfe01', 1985, 12, 17, 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', 220, 73, 'L', 'L', '2010-07-28', '2019-09-28', 'abadf001', 'abadfe01', datetime.date(1985, 12, 17), datetime.date(2010, 7, 28), datetime.date(2019, 9, 28), None, 'DOM', 'DO', 'Dominican Republic'),
 ('abadijo01', 1850, 11, 4, 'PA', 'Philadelphia', 1905, 5, 17, 'USA', 'NJ', 'Pemberton', 'John', 'Abadie', 'John W.', 192, 72, 'R', 'R', '1875-04-26', '1875-06-10', 'abadj101', 'abadijo01', datetime.date(1850, 11, 4), datetime.date(1875, 4, 26), datetime.date(1875, 6, 10), datetime.date(1905, 5, 17), 'USA', 'US', 'United States'),
 ('abbated01', 1877, 4, 15, 'PA', 'Latrobe', 1957, 1, 6, 'USA', 'FL', 'Fort Lauderdale', 'Ed', 'Abbaticchio', 'Edward James', 170, 71, 'R', 'R', '1897-09-04', '1910-09-15', 'abbae101', 'abbated01', datetime.date(1877, 4, 15), datetime.date(1897, 9, 4), datetime.date(1910, 9, 15), datetime.date(1957, 1, 6), 'USA', 'US', 'United States'),
 ('abbeybe01', 1869, 11, 11, 'VT', 'Essex', 1962, 6, 11, 'USA', 'VT', 'Colchester', 'Bert', 'Abbey', 'Bert Wood', 175, 71, 'R', 'R', '1892-06-14', '1896-09-23', 'abbeb101', 'abbeybe01', datetime.date(1869, 11, 11), datetime.date(1892, 6, 14), datetime.date(1896, 9, 23), datetime.date(1962, 6, 11), 'USA', 'US', 'United States'),
 ('abbeych01', 1866, 10, 14, 'NE', 'Falls City', 1926, 4, 27, 'USA', 'CA', 'San Francisco', 'Charlie', 'Abbey', 'Charles S.', 169, 68, 'L', 'L', '1893-08-16', '1897-08-19', 'abbec101', 'abbeych01', datetime.date(1866, 10, 14), datetime.date(1893, 8, 16), datetime.date(1897, 8, 19), datetime.date(1926, 4, 27), 'USA', 'US', 'United States')]

In [25]:
%%sql

SELECT birthCountryISO3, birthCountryISO2, Correct_Country_Name FROM people_modified LIMIT 10

 * mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/F21Midterm
   mysql+pymysql://admin:***@tutorialdb.cbezzskgwcl3.us-east-2.rds.amazonaws.com/lahmansbaseballdb
10 rows affected.

[('USA', 'US', 'United States'),
 ('USA', 'US', 'United States'),
 ('USA', 'US', 'United States'),
 ('USA', 'US', 'United States'),
 ('USA', 'US', 'United States'),
 ('DOM', 'DO', 'Dominican Republic'),
 ('USA', 'US', 'United States'),
 ('USA', 'US', 'United States'),
 ('USA', 'US', 'United States'),
 ('USA', 'US', 'United States')]